backend/models/RegisterForm.php

    public function register()
    {
        // 1. 先通过 rules() 校验表单数据
        if (!$this->validate()) {
            return null;
        }
        // 2. 创建 User 模型实例并赋值
        $user = new User();
        $user->username = $this->username;
        $user->status = $user::STATUS_ACTIVE;
        // 3. 核心步骤：使用安全组件对密码进行单向哈希加密
        $user->setPassword($this->password);

        // 4. 生成认证密钥（用于 Cookie 自动登录）
        $user->generateAuthKey();

        // 5. 将数据保存到数据库
        if ($user->save()) {
---
INSERT INTO `user` (`username`, `status`, `password_hash`, `auth_key`, `created_at`, `updated_at`) VALUES ('yoga', 10, '$2y$13$96YcWEuButPRgT7r4i30jehh.COYdV9i7y4ahYVfleVnJy7J/vHpe', 'QAmcPS_zXgx56DY5hYyyc3WKAMBNHK59', NOW(), NOW())

    public function getUser()
    {
        // 1. 尝试调用 register() 方法保存数据
        // 注意：这里需要根据你的业务逻辑调整。
        // 如果你的 Controller 里已经调用了 $model->register()，那么这里只需要查询即可。
        // 但为了配合你截图中的控制器写法，我们在这里做完整的“保存+获取”动作。
        if ($this->username) {
            return User::findOne(['username' => $this->username]);
---
SELECT * FROM `user` WHERE `username`='yoga'